[
  {
    "title": "Machine Learning Engineer & Researcher",
    "location": "Gdańsk",
    "date": "11.2024 - present",
    "company": "Gdańsk Medical University - MiLab organisation",
    "description": [
      "Develop and refine deep learning models for spinal stenosis classification, muscle activity analysis, and soft tissue segmentation (muscles, nerves) as part of the ML.Spine project, utilizing state-of-the-art AI techniques and classical machine learning approaches",
      "Integrate advanced visualization tools to present segmentation and classification results to clinical experts, improving interpretability and facilitating medical decision-making"
    ],
    "technologies": [
      "Python",
      "scikit-learn",
      "Pandas",
      "Numpy",
      "Microsoft Office",
      "PyTorch",
      "OpenAI",
      "Hugging Face"
    ]
  },
    {
      "title": "ERP Systems Administrator & SQL Developer",
      "location": "Bydgoszcz, Remote",
      "date": "06.2024 - 12.2024",
      "company": "IDEA commerce S.A.",
      "description": [
        "Analyzed and integrated APIs from 5+ companies to develop custom solutions for e-commerce platforms, leading to a ~8% increase in customer engagement through enhanced product offerings",
        "Developed and optimized ETL (Extract, Transform, Load) processes for Metabase, enhancing data accuracy",
        "Leveraged PostgreSQL data to identify trending products for over 12 clients, streamlining inventory management and reducing stockouts by ~15%, contributing to a ~18% increase in sales efficiency.",
        "Created dynamic and insightful data visualizations using BI tools, empowering teams to track key metrics and uncover business trends, leading to a ~11% improvement in operational decision-making.",
        "Provided strategic consulting to e-commerce clients, optimizing store operations and contributing to improved sales performance."
      ],
      "technologies": [
        "Python",
        "FastApi",
        "SQL",
        "Pandas",
        "Numpy",
        "PostgreSQL",
        "Oddo",
        "Metabase BI",
        "PowerBI",
        "Microsoft Office",
        "ERP",
        "Customer Service"
      ]
    },
    {
      "title": "Mobile Application Developer (Erasmus+ Intern)",
      "location": "Sevilla",
      "date": "01.2023 - 02.2023",
      "company": "V-Art Escuela Audiovisual",
      "description": [        
        "Developed and deployed Android mobile applications using Java and Android Studio, following object-oriented programming (OOP) principles to create scalable and maintainable code",
        "Designed a tourist places app with an integrated interactive map and API functionality, allowing users to explore nearby tourist destinations with detailed information",
        "Implemented essential features such as user authentication, data storage with SQLite, and a dynamic user interface, which improved the overall user experience and functionality of the app"
      ],
      "technologies": [
        "Java",
        "Android Studio",
        "Google Maps API",
        "SQLite",
        "Firebase",
        "Git",
        "Spline"
      ]    
    },
    {
      "title": "Frontend Developer Intern",
      "location": "Bydgoszcz",
      "date": "04.2022 - 05.2022",
      "company": "BluSoft Sp. z o.o.",
      "description": [
        "Collaborated with cross-functional teams, including designers, product managers, and QA specialists, to design and implement RESTful APIs and user interfaces for over 5 event websites and company pages in Bydgoszcz, ensuring seamless integration and a 10% improvement in user interaction",
        "Spearheaded the development and maintenance of both front-end and back-end features, leveraging JavaScript, Node.js, Express, and React to build dynamic, responsive applications that improved user experience and system performance",
        "Implemented an efficient content management system (CMS), allowing event organizers and business owners to update their sites independently, improving workflow and reducing update times by ~30%"
    ],
      "technologies": [
        "JavaScript",
        "TypeScript",
        "PHP",
        "Node.js",
        "Express",
        "React",
        "Axios",
        "Scss",
        "Css",
        "Html",
        "Git"
      ]    
    },
    {
      "title": "Graphic Designer Intern",
      "location": "Bydgoszcz",
      "date": "11.2020 - 12.2020",
      "company": "Studio Omega",
      "description": [
        "Developed a strong understanding of color management and layout for print, ensuring consistency across all deliverables and contributing to a 10% increase in client satisfaction",
        "Assisted in automating the design processing workflow, streamlining file handling and approval stages, which improved overall efficiency and reduced processing time by 10%",
        "Created vector graphics using Adobe Illustrator",
        "Gained knowledge in print production and publishing processes"
    ],
      "technologies": [
        "Adobe Illustrator",
        "Adobe Photoshop",
        "Excel",
        "Spline"
      ]
      }
  ]
  